Revit 2027 API
HorizontalTextAlignment Enumeration
 Supported types of horizontal alignment of a text element and text justification within the text containing box.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum HorizontalTextAlignment
Public Enumeration HorizontalTextAlignment
public enum class HorizontalTextAlignment
type HorizontalTextAlignment
Members
Member name | Value | Description
Center | 2 |  Text is Center justified inside the containing text box, and the center side of the text box remains in place as the width changes.
Left | 0 |  Text is Left justified inside the containing text box, and the left side of the text box remains in place as the width changes.
Right | 1 |  Text is Right justified inside the containing text box, and the right side of the text box remains in place as the width changes.
See Also
Reference
Autodesk.Revit.DB Namespace